tap "atlassian/acli", trusted: true
tap "azure/kubelogin", "https://github.com/Azure/homebrew-kubelogin", trusted: true
tap "charmbracelet/tap", trusted: true
tap "cloudfoundry/tap", trusted: true
tap "databricks/tap", trusted: true
tap "grafana/grafana", trusted: true
tap "haiperspace/hai", "https://github.tools.sap/hAIperspace/hai-homebrew", trusted: true
tap "itouuuuuuuuu/tap", trusted: true
tap "leanix/hook-tools", "git@github.com:leanix/leanix-hook-tools.git", trusted: true
tap "mvndaemon/mvnd", trusted: true
tap "peonping/tap", "https://github.com/PeonPing/homebrew-tap", trusted: true
tap "sdkman/tap", trusted: true
# Interpreted, interactive, object-oriented programming language
brew "python@3.14"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Microsoft Azure CLI 2.0
brew "azure-cli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# CLI of the open-source IDE For exploring and testing APIs
brew "bruno-cli"
# Validate and define text-based and dynamic configuration
brew "cue"
# DuckDuckGo from the terminal
brew "ddgr"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# Pack, ship and run any application as a lightweight container
brew "docker", link: false
# Isolated development environments using Docker
brew "docker-compose"
# Run arbitrary commands when files change
brew "entr"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Quickly rewrite git repository history
brew "git-filter-repo"
# Audit git repos for secrets
brew "gitleaks"
# Render markdown on the CLI
brew "glow"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Development kit for the Java programming language
brew "openjdk"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Modern alternative to the watch command
brew "hwatch"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Feature-rich interactive Jira CLI
brew "jira-cli"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Modern load testing tool, using Go and JavaScript
brew "k6"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Package manager for kubectl plugins
brew "krew"
# Development kit for the Java programming language
brew "openjdk@17"
# Kotlin code formatter
brew "ktfmt"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Lazier way to manage everything docker
brew "lazydocker"
# Simple terminal UI for git commands
brew "lazygit"
# Powerful, lightweight programming language
brew "lua"
# Java-based project management
brew "maven"
# Bash completion for Maven
brew "maven-completion"
# CLI for Mermaid library
brew "mermaid-cli"
# Simple tool to make locally trusted development certificates
brew "mkcert"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Prompt theme engine for any shell
brew "oh-my-posh"
# Development kit for the Java programming language
brew "openjdk@21"
# Spec-driven development (SDD) for AI coding assistants
brew "openspec"
# CLI for Postgres with auto-completion and syntax highlighting
brew "pgcli"
# Draw UML diagrams
brew "plantuml"
# Object-relational database system
brew "postgresql@14"
# Tool Command Language
brew "tcl-tk"
# Python interface to Tcl/Tk
brew "python-tk@3.14"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Run Rust files and expressions as scripts without any setup or compilation step
brew "rust-script"
# Tail multiple Kubernetes pods & their containers
brew "stern"
# Tool to build, change, and version infrastructure
brew "terraform", link: false
# Terraform version manager inspired by rbenv
brew "tfenv"
# Terminal multiplexer
brew "tmux"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Modern watch command
brew "viddy"
# Executes a program periodically, showing output fullscreen
brew "watch"
# Internet file retriever
brew "wget"
# Process YAML, JSON, XML, CSV and properties documents from the CLI
brew "yq"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Software to interact with Atlassian Cloud from the terminal
brew "atlassian/acli/acli"
# A Kubernetes credential (exec) plugin implementing azure authentication
brew "azure/kubelogin/kubelogin"
# Cloud Foundry CLI
brew "cloudfoundry/tap/cf-cli@8"
# Command-line interface for the Databricks platform
brew "databricks/tap/databricks"
# Grafana Cloud CLI
brew "grafana/grafana/gcx"
# HAIperspace command line interface
brew "haiperspace/hai/hai"
# LeanIX Team Hook CLI tools
brew "leanix/hook-tools/leanix-hook-tools"
# Apache Maven Daemon
brew "mvndaemon/mvnd/mvnd@1"
# SDKMAN! the Software Development Kit Manager
brew "sdkman/tap/sdkman-cli"
# Desktop password and login vault
cask "bitwarden"
# Open source IDE for exploring and testing APIs
cask "bruno"
# CLI for the SAP Business Technology Platform
cask "btp"
# Terminal-based AI coding assistant
cask "claude-code"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Online diagram software
cask "drawio"
cask "font-jetbrains-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Grammarly for desktop
cask "grammarly-desktop"
# Desktop automation application
cask "hammerspoon"
# Web browser
cask "sigmaos"
# CP210x USB to UART Bridge VCP Driver
cask "silicon-labs-vcp-driver"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Menu bar app that displays battery levels from ZMK split keyboards via BLE
cask "itouuuuuuuuu/tap/zmk-battery-bar"
go "gitlab.com/harogaston/tmuxier"
uv "kanban-tui[jira]"
krew "oidc-login"
npm "corepack"
